/*TODO: Умовні розгалуження: if, '?'
Іноді нам потрібно виконувати різні дії на основі різних умов.
Для цього ми можемо використовувати інструкцію if та умовний оператор ?, що також називається оператором “знак питання”.
*/
//Інструкція if(...) обчислює умову в дужках і, якщо результат умови true, виконує блок коду.
let year = prompt('В якому році була опублікована специфікація ECMAScript-2015?', '');
if (year == 2015) alert( 'Ви маєте рацію!' );

//Якщо ми хочемо виконати більше однієї інструкції, ми повинні загорнути блок коду у фігурні дужки:
if (year == 2015) {
    console.log( "Це правильно!" );
    console.log( "Ви такий розумний!" );
}

//TODO: Блок “else”. Він виконується, коли умова є хибною.
let yearO = prompt('В якому році була опублікована специфікація ECMAScript-2015?', '');
if (yearO == 2015) {
    alert( 'Ви здогадалися правильно!' );
    } else {
    alert( 'Як ви можете так помилятися?' ); // будь-яке значення, окрім 2015
}

//TODO: Декілька умов: “else if”
let yearA = prompt('В якому році була опублікована специфікація ECMAScript-2015?', '');

if (yearA < 2015) {
  alert( 'Зарано...' );
} else if (year > 2015) {
  alert( 'Запізно' );
} else {
  alert( 'Саме так!' );
}