/*TODO: Логічні оператори 
В JavaScript існує чотири логічні оператори: 
|| (АБО), 
&& (І), 
! (НЕ), 
?? (оператор null-об’єднання). 
В цьому розділі ми розглянемо перші три оператори, а оператор ?? — в наступному розділі.
*/

/*TODO: ||(АБО). Знаходить перше правдиве значення
Оператор АБО || робить наступне:

Обчислює операнди зліва направо.
Перетворює значення кожного операнда на булеве. Якщо результат true, зупиняється і повертає початкове значення цього операнда.
Якщо всі операнди були обчисленні (тобто усі були false), повертає останній операнд.
*/
result = a || b;
//
alert(true || true);   // true
alert(false || true);  // true
alert(true || false);  // true
alert(false || false); // false
//
if (1 || 0) { // працює так само, як ( true || false )
alert('правдиво!');
}

//У більшості випадків АБО || використовується в інструкціях if, щоб перевірити, чи є будь-яка із заданих умов true.
let hour = 12;
let isWeekend = true;
if (hour < 10 || hour > 18 || isWeekend) {
  alert( 'Офіс зачинений.' ); // це вихідні
}

/*TODO: &&(І). Шукає перше хибне значення. 
У класичному програмуванні І повертає true, якщо обидва оператори є правдивими, і false в іншому випадку:
*/
result = a && b;
//
let hours = 12;
let minute = 30;
if (hours == 12 && minute == 30) {
  alert( 'Час: 12:30' );
}

/*TODO: !(НЕ)
Булевий оператор НЕ представлений знаком оклику !.
*/
result = !value;