/*TODO: Оператори порівняння
1 ) Більше/менше: a > b, a < b.
2 ) Більше/менше або дорівнює: a >= b, a <= b.
3 ) Дорівнює: a == b. Зверніть увагу, для порівняння потрібно використовувати два знаки рівності ==. Один знак рівності a = b означав б присвоєння.
4 ) Не дорівнює: в математиці позначається символом ≠, проте в JavaScript записується як a != b.
*/

/*TODO: Результат порівняння має логічний тип 
Всі оператори порівняння повертають значення логічного типу:
true – означає “так”, “правильно” або “істина”.
false – означає “ні”, “неправильно” або “хибність”.
*/
console.log(2 > 1);  // true (правильно)
console.log(2 == 1); // false (неправильно)
console.log(2 != 1); // true (правильно)